# LAB 04 - Data Preprocessing 2

## 2. 행 기준 병합

### #01. 준비작업

In [1]:
# 1. 패키지 참조:
from pandas import DataFrame
from pandas import concat

In [2]:
# 2. 샘플데이터 생성:
df1 = DataFrame(
    {
        '이름': ['영희', '철수'],
        '국어': [87, 91]
    }
)
df1

   이름  국어
0  영희  87
1  철수  91

In [3]:
df2 = DataFrame(
    {
        '이름': ['민철', '수현'],
        '국어': [78, 92]
    }
)
df2

   이름  국어
0  민철  78
1  수현  92

### #02. concat() 함수의 기본 사용법

In [5]:
# 1. 병합하기:
# - 병합할 데이터 프레임을 리스트로 묶기 (2개 이상 가능)
# - 각 데이터프레임이 갖는 인덱스는 그대로 유지됨 (인덱스 중복 발생)
concat([df1, df2])

   이름  국어
0  영희  87
1  철수  91
0  민철  78
1  수현  92

In [6]:
# 2. 병합 결과에서 index 재구성하기

# 1) 지금까지 공부한 내용 만으로 처리하는 방법:
인덱스_재구성df = concat([df1, df2])
인덱스_재구성df.reset_index(inplace = True, drop = True)
인덱스_재구성df

   이름  국어
0  영희  87
1  철수  91
2  민철  78
3  수현  92

In [7]:
# 2) concat() 함수 파라미터로 처리하는 방법:
#  - ignore_index = True 파라미터를 concat() 안에 넣으면 
#    병합 후 인덱스 알아서 재구성해줌
concat([df1, df2], ignore_index = True)

   이름  국어
0  영희  87
1  철수  91
2  민철  78
3  수현  92

### #03. 서로 다른 변수를 갖는 데이터프레임 병합방법

In [9]:
# 1. 샘플 데이터 구성먼저 ㄱ:
df3 = DataFrame(
    {
        '이름': ['영희', '철수'],
        '국어': [87, 91]
    }
)
df3

   이름  국어
0  영희  87
1  철수  91

In [10]:
df4 = DataFrame(
    {
        '이름': ['민철', '수현'],
        '수학': [78, 92]
    }
)
df4

   이름  수학
0  민철  78
1  수현  92

In [11]:
# 2. 데이터 병합:
# - 일치하지 않는 부분에 대해서는 NaN으로 처리됨
concat([df3, df4], ignore_index = True)

   이름    국어    수학
0  영희  87.0   NaN
1  철수  91.0   NaN
2  민철   NaN  78.0
3  수현   NaN  92.0

### #04. 인덱스를 갖는 데이터프레임 병합방법

In [13]:
# 1. 샘플데이터 구성 ㄱ:
df5 = DataFrame(
    {'국어': [87, 91, 85]},
    index = ['영희', '철수', '민수']
)
df5

    국어
영희  87
철수  91
민수  85

In [14]:
df6 = DataFrame(
    {'국어': [78, 92, 82]},
    index = ['민철', '수현', '민수']
)
df6

    국어
민철  78
수현  92
민수  82

In [16]:
# 2. 데이터 병합:
# - 인덱스도 같이 병합된다
# - 각 데이터프레임 간에 중복되는 인덱스가 존재할 경우 
#   각 행은 개별적으로 존재하게됨! (인덱스 중복)
concat([df5, df6])

    국어
영희  87
철수  91
민수  85
민철  78
수현  92
민수  82

In [17]:
# 3. 인덱스 제외하고 병합하기
# - ignore_index = True 파라미터 설정하면 해결! (but 인덱스였던 이름이 없어짐..)
concat([df5, df6], ignore_index = True)

   국어
0  87
1  91
2  85
3  78
4  92
5  82